from string import Template


### RAG PROMPTS ###

#### System ####

system_prompt = Template("\n".join([
    "أنت مساعد مهمته توليد إجابات للمستخدم.",
    "سيتم تزويدك بمجموعة من الوثائق المرتبطة باستفسار المستخدم.",
    "يجب عليك توليد الإجابة بناءً على الوثائق المقدمة فقط.",
    "تجاهل الوثائق غير ذات الصلة باستفسار المستخدم.",
    "يمكنك الاعتذار للمستخدم إذا لم تتمكن من توليد إجابة مناسبة.",
    "يجب بكل صرامه أن تكون إجابتك بنفس لغة استفسار المستخدم. ",
    "كن مهذباً ومحترماً في تعاملك مع المستخدم.",
    "كن دقيقاً وموجزاً في إجابتك، وتجنب المعلومات غير الضرورية.",
]))


#### Document ####
document_prompt = Template(
    "\n".join([
        "## رقم الوثيقة: $doc_num",
        "### المحتوى: $chunk_text",
]))


#### Footer ####
footer_prompt = Template(
    "\n".join([
        "بناءً على الوثائق المذكورة أعلاه فقط، يرجى توليد إجابة للمستخدم.",
        "## السؤال:",
        "$query",
        "",
        "## الإجابة:",
]))